In [1]:
import pandas as pd
import numpy as np

from scipy import stats
from scipy.stats import norm

import math
from scipy.stats import chi2_contingency
from scipy.stats import chi2

import warnings
warnings.filterwarnings('ignore')

<h3> Question 1 </h3>

In [3]:
cutlets=pd.read_csv('Cutlets.csv')
cutlets.head()

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

In [4]:
unitA=pd.Series(cutlets.iloc[:,0])
unitA.head(5)

0    6.8090
1    6.4376
2    6.9157
3    7.3012
4    7.4488
Name: Unit A, dtype: float64

In [5]:
unitB=pd.Series(cutlets.iloc[:,1])
unitB.head(5)

0    6.7703
1    7.5093
2    6.7300
3    6.7878
4    7.1522
Name: Unit B, dtype: float64

In [6]:
Ttest_ind=stats.ttest_ind(unitA,unitB)
print(Ttest_ind)
print()
p_value = Ttest_ind[1]

alpha = 0.05
if p_value > alpha:
    print("Accept Null Hypothesis")
else:
    print("Accept Alternate Hypothesis")

Ttest_indResult(statistic=0.7228688704678063, pvalue=0.4722394724599501)

Accept Null Hypothesis

<h3> Question 2 </h3>

In [7]:
data=pd.read_csv('LabTAT.csv')
data.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [11]:
p_value1=stats.f_oneway(data.iloc[:,0],data.iloc[:,1],data.iloc[:,2],data.iloc[:,3])
p_value1

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

In [13]:
p_value = p_value1[1]
alpha = 0.05
if p_value > alpha:
    print("Accept Null Hypothesis")
else:
    print("Accept Alternate Hypothesis")

Accept Alternate Hypothesis

<h3> Question 3 </h3>

In [16]:
data = pd.read_csv("BuyerRatio.csv")
data

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [17]:
data = data.drop('Observed Values', axis=1)
data

   East  West  North  South
0    50   142    131     70
1   435  1523   1356    750

In [18]:
stat,p,dof,expected=stats.chi2_contingency(data)
alpha =0.05

In [22]:
print("Chi Square test value is ", p)
if p<=alpha:
    print("Accept Alternate Hypothesis")
else:
    print("Accept Null Hypothesis")

Chi Square test value is  0.6603094907091882
Accept Null Hypothesis

<h3> Question 4 </h3>

In [23]:
co=pd.read_csv('Costomer+OrderForm.csv')
co.head()

  Phillippines   Indonesia       Malta       India
0   Error Free  Error Free   Defective  Error Free
1   Error Free  Error Free  Error Free   Defective
2   Error Free   Defective   Defective  Error Free
3   Error Free  Error Free  Error Free  Error Free
4   Error Free  Error Free   Defective  Error Free

In [24]:
co['Phillippines'].value_counts()

Error Free    271
Defective      29
Name: Phillippines, dtype: int64

In [25]:
co['Indonesia'].value_counts()

Error Free    267
Defective      33
Name: Indonesia, dtype: int64

In [26]:
co['Malta'].value_counts()

Error Free    269
Defective      31
Name: Malta, dtype: int64

In [27]:
co['India'].value_counts()

Error Free    280
Defective      20
Name: India, dtype: int64

In [28]:
crosstab=np.array([[271,267,269,280],[29,33,31,20]])
crosstab

array([[271, 267, 269, 280],
       [ 29,  33,  31,  20]])

In [30]:
chi2_contingency(crosstab) 
if 0.2771 > 0.05:
    print("Accept Null Hypothesis")
else:
    print("Accept Alternate Hypothesis")

Accept Null Hypothesis